<?php
return [
    "module" => "مجموعات الأعضاء",
    'groups' => 'مجموعات الأعضاء',
    'group' => 'مجموعة',
    'add_new' => 'إضافة مجموعة جديدة',
    'edit' => 'تعديل المجموعة',
    'back_to_groups' => 'العودة لمجموعات الأعضاء',
    'no_records' => 'لا توجد مجموعات',
    'save_group' => 'حفظ المجموعة',
    'search' => 'بحث',
    'search_groups' => 'البحث فى المجموعات',
    'per_page' => 'لكل صفحة',
    'bulk_actions' => 'إختر أمر',
    'delete' => 'حذف',
    'apply' => 'تطبيق',
    'page' => 'الصفحة',
    'of' => 'من',
    'order' => 'ترتيب',
    'sort_by' => 'ترتيب حسب',
    'asc' => 'تصاعدى',
    'desc' => 'تنازلى',
    'actions' => 'الحدث',
    'filter' => 'عرض',
    
    'group_status' => 'الحالة',
    'activate' => 'تفعيل',
    'activated' => 'مفعل',
    'all' => 'كل المجموعات',
    'deactivate' => 'إلغاء التفعيل',
    'deactivated' => 'غير مفعل',
    'sure_activate' => "تفعيل المجموعة ?",
    'sure_deactivate' => "إلغاء تفعيل المجموعة ?",
    'sure_delete' => 'أنت على وشك الحذف . إستمرار ?',
    'users_count' => 'عدد الأعضاء',
    'users' => 'أعضاء المجموعة',
    'user' => 'بواسطة',
    'attributes' => [
        'name' => 'إسم المجموعة',
        'description' => 'الوصف',
        'created_at' => 'تاريخ الإنشاء',
        'updated_at' => 'تاريخ التحديث',
        'status' => 'التفعيل'
    ],
    "events" => [
        'created' => 'تم إنشاء مجموعة بنجاح',
        'updated' => 'تم تحديث المجموعة بنجاح',
        'deleted' => 'تم حذف المجموعة بنجاح',
        'activated' => 'تم تفعيل المجموعة بنجاح',
        'deactivated' => 'تم إلغاء تفعيل المجموعة بنجاح'
    ],
    "permissions" => [
        "create" => "إضافة مجموعة أعضاء جديدة",
        "edit" => "تعديل مجموعات الأعضاء",
        "delete" => "حذف المجموعات",
    ]
    
];
